public class Main {

    //    Домашнее задание 3
    //    Задание 5
    //    Проверьте, можно ли создать переменные со следующими именами: uberflu? , _Identifier , \u006fIdentifier , &myVar , myVariab1le

//    int uberflu?;             // нельзя создать: недопустимый символ в конце
      int _Identifier;          // можно создать, но противоречит соглашению по созданию символов, начинать с подчеркивания не рекомендуют
//    int \u006fIdentifier;      // нельзя создать: недопустимый символ в начале
//    int &myVar;                 // нельзя создать: недопустимый символ в начале
      int myVariab1le;            // можно создать, это является допустимым названием переменной

}
