class main {
    public static void main(String[] args) {
        // Домашнее задание 3
        // Задание 6
        // Используя IntelliJ IDEA, создайте проект c классом main.
        // Создайте две целочисленные переменные и выведите на экран результаты всех арифметических операций над этими двумя переменными.
        int a = 3;
        int b = 5;
        System.out.println("1. Прибавление, равно: " + (a + b));
        System.out.println("2. Вычитание, равно: " + (a - b));
        System.out.println("3. Умножение, равно: " + (a * b));
        System.out.println("4. Деление, равно: " + (a / b));
        System.out.println("5. Прибавление с присвоением, равно: " + (a += b));
        System.out.println("6. Вычитание с присвоением, равно: " + (a -= b));
        System.out.println("7. Умножение с присвоением, равно: " + (a *= b));
        System.out.println("8. Деление с присвоением, равно: " + (a /= b));
        System.out.println("9. Остаток от целочисленного деления, равно: " + (a % b));
        System.out.println("10. Остаток с присвоением, равно: " + (b %= a));
        System.out.println("11. Инкремент, равно: " + (++a));
        System.out.println("12. Декримент, равно: " + (--b));

    }
}
